Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P03.tmx
Source language: en_us
Languages: zh_cn

source: The Third Wish
zh_cn: 第三个愿望

source: Once there was a man who was driving in his car at dusk on a spring evening through part of the forestofSavernake.
zh_cn: 从前有个人在一个春天的傍晚开着车穿行于萨弗纳克森林。

source: His name was Mr. Peters.
zh_cn: 他名叫皮特斯先生。

source: The primroses were just beginning but the trees were still bare, and it was cold; the birds had stopped singing an hour ago.
zh_cn: 报春花刚刚开始开放，但是树木还是光秃秃的，天气还很寒冷；鸟在一个小时前就停止了歌唱。

source: As Mr. Peters entered a straight, empty stretch of road he seemed to hear a faint crying, and a struggling and thrashing, as if somebody was in trouble far away in the trees.
zh_cn: 皮特斯先生驶入一段笔直的、空荡荡的路上时，他仿佛听到一声微弱的叫喊和挣扎扑打声，好像是有人在远处的树林里遇到了麻烦。

source: He left his car and climbed the mossy bank beside the road.
zh_cn: 他离开车，爬上路边长满青苔的河岸。

source: Beyond the bank was an open slope of beech trees leading down to thorn bushes through which he saw the gleam of water.
zh_cn: 在河岸的那一边是一片开阔的长着山毛榉树的斜坡，一直通到底下的荆棘丛，透过荆棘丛他看到水的微光。

source: He stood a moment waiting to try and discover where the noise was coming from, and presently heard a rustling and some strange cries in a voice which was almost human--and yet there was something too hoarse about it at one time and too clear and sweet at another.
zh_cn: 他站了一会儿，试图寻找那声音是从哪里来的，不一会儿他听到了沙沙声和一些奇怪的叫声，那叫声几乎是人类的声音——不过这声音有时有点太沙哑，有时又太清亮甜美。

source: Mr. Peters ran down the hill and as he neared the bushes he saw something white among them which was trying to extricate itself; coming closer he found that it was a swan that had become entangled in the thorns growing on the bank of the canal.
zh_cn: 皮特斯先生跑下斜坡，他走近荆棘丛时看到里面有白色的东西正在试图从中解脱出来；走得更近些，他发现是一只天鹅缠在生长在运河岸边的荆棘中了。

source: The bird struggled all the more frantically as he approached, looking at him with hate in its yellow eyes, and when he took hold of it to free it, hissed at him, pecked him, and thrashed dangerously with its wings which were powerful enough to break his arm.
zh_cn: 这只鸟在他走近时挣扎得更疯狂，它黄色的眼睛里带着憎恨看着他，当他抓住它把它解救出来时，它对他发出咝咝声，啄他，用它那有力到足以打折他的胳膊的翅膀很凶险地拍打。

source: Nevertheless he managed to release it from the thorns, and carrying it tightly with one arm, holding the snaky head well away with the other hand (for he did not wish his eyes pecked out), he took it to the verge of the canal and dropped it in.
zh_cn: 不过他最终将它从荆棘丛中解救了出来，一只胳膊紧紧地抱着它，另一手离开身体远远地握着它阴险的头（因为他不希望自己的眼睛被啄出来），他把它带到河边，放进河里。

source: The swan instantly assumed great dignity and sailed out to the middle of the water, where it put itself to rights with much dabbling and preening, smoothing its feathers with little showers of drops.
zh_cn: 这只天鹅立刻表现出极为高贵的样子，它游到水中央，在那里洒水、用嘴整理打扮、喷上连串的水珠抚平羽毛，把自己收拾好。

source: Mr. Peters waited, to make sure that it was all right and had suffered no damage in its struggles.
zh_cn: 皮特斯先生等着，以确定它没事，在它挣扎过程中没有遭受损伤。

source: Presently the swan, when it was satisfied with its appearance, floated in to the bank once more, and in a moment, instead of the great white bird, there was a little man all in green with a golden crown and long beard, standing by the water.
zh_cn: 不一会儿，当那只天鹅对自己的外表满意了时，它又一次游到岸边，只一瞬间，一个身材矮小、全身着绿、头戴一顶金色王冠、长着长长胡须的男人替换了那只白色的大鸟站在水边。

source: He had fierce glittering eyes and looked by no means friendly.
zh_cn: 他目露凶光，看上去一点儿都不友好。

source: "Well, Sir," he said threateningly, "I see you are presumptuous enough to know some of the laws of magic.
zh_cn: “噢，先生，”他凶狠狠地说，“我知道你自以为懂一些魔法规则。

source: You think that because you have rescued--by pure good fortune--the King of theForestfrom a difficulty, you should have some fabulous reward."
zh_cn: 你认为因为你营救——纯粹是由于好运气——森林之王脱离困境，你就应该得到一些神奇的奖赏。”

source: "I expect three wishes, no more and no less," answered Mr. Peters, looking at him steadily and with composure.
zh_cn: “我希望得到三个愿望，不多也不少，”皮特斯先生沉着坚定地看着他回答道。

source: "Three wishes, he wants, the clever man!
zh_cn: “三个愿望，他想要，聪明人！

source: Well, I have yet to hear of the human being who made any good use of his three wishes--they mostly end up worse off than they started.
zh_cn: 好吧，我还从未听说有人好好利用了他的三个愿望——他们的结果大都比开始时更糟。

source: Take your three wishes then--" he flung three dead leaves in the air "--don't blame me if you spend the last wish in undoing the work of the other two."
zh_cn: 那就拿走你的三个愿望吧——”他向空中抛了三片枯叶“——要是你用最后一个愿望来取消另两个的后果，可别怪我。”

source: Mr. Peters caught the leaves and put two of them carefully in his notecase.
zh_cn: 皮特斯先生抓住叶子，将其中两片小心地放进他的钱夹。

source: When he looked up the swan was sailing about in the middle of the water again, flicking the drops angrily down its long neck.
zh_cn: 当他抬起头时，那只天鹅又在水中央游来游去了，它愤怒地泼洒着水，水滴沿着它长长的脖子流下。

source: Mr. Peters stood for some minutes reflecting on how he should use his reward.
zh_cn: 皮特斯先生站了几分钟，考虑他应该如何使用他的奖赏。

source: He knew very well that the gift of three magic wishes was one which brought trouble more often than not, and he had no intention of being like the forester who first wished by mistake for a sausage, and then in a rage wished it on the end of his wife's nose, and then had to use his last wish in getting it off again.
zh_cn: 他非常清楚三个魔法愿望是个常常带来麻烦的礼物，他可不愿像那个林务官，第一个愿望弄错了要了根香肠，愤怒之下又许愿它长在他妻子的鼻子尖上，然后不得不用他最后一个愿望再次将它取下来。

source: Mr. Peters had most of the things which he wanted and was very content with his life.
zh_cn: 皮特斯先生想要的东西大都已经有了，他对自己的生活也很满意。

source: The only thing that troubled him was that he was a little lonely, and had no companion for his old age.
zh_cn: 唯一一件让他烦心的事是他有点孤单，老时无伴。

source: He decided to use his first wish and to keep the other two in case of an emergency.
zh_cn: 他决定使用他的第一个愿望，保存另两个愿望以备不时之需。

source: Taking a thorn he pricked his tongue with it, to remind himself not to utter rash wishes aloud.
zh_cn: 他拿起一根荆棘刺了一下他的舌头，提醒自己不要大声说出轻率的愿望。

source: Then holding the third leaf and gazing round him at the dusky undergrowth, the primroses, great beeches and the blue-green water of the canal, he said:
zh_cn: 然后手拿第三片叶子，凝视着周围黑暗的灌木丛、报春花、高大的山毛榉树和运河里青绿色的水，他说：

source: "I wish I had a wife as beautiful as the forest."
zh_cn: “我希望有一个美如森林的妻子。”

source: A tremendous quacking and splashing broke out on the surface of the water.
zh_cn: 水面上猛地发出一声巨大的嘎嘎声和水的泼溅声。

source: He thought that it was the swan laughing at him.
zh_cn: 他想是那只天鹅在嘲笑他。

source: Taking no notice he made his way through the darkening woods to his car, wrapped himself up in the rug and went to sleep.
zh_cn: 他没有理会，穿过变暗的树林回到车上，裹上毛毯睡了。

source: When he awoke it was morning and the birds were beginning to call.
zh_cn: 当他醒来时，已是早晨了，鸟开始叫了。

source: Coming along the track towards him was the most beautiful creature he had ever seen, with eyes as blue-green as the canal, hair as dusky as the bushes, and skin as white as the feathers of swans.
zh_cn: 沿着道路向他走来的是他曾见过的最美丽的生物，眼睛如运河般青绿，头发如灌木丛般漆黑，皮肤如天鹅羽毛般洁白。

source: "Are you the wife that I wished for?" asked Mr. Peters.
zh_cn: “你是我许愿要的妻子吗？”皮特斯先生问道。

source: "Yes I am," she replied. "My name is Leita."
zh_cn: “是的，我是，”她答道，“我叫蕾塔。”

source: She stepped into the car beside him and they drove off to the church on the outskirts of the forest, where they were married.
zh_cn: 她上了车，坐在他旁边，他们开车去森林边上的教堂，在那里他们结了婚。

source: Then he took her to his house in a remote and lovely valley and showed her all his treasures--the bees in their white hives, theJerseycows, the hyacinths, the silver candlesticks, the blue cups and the lustre bowl for putting primroses in.
zh_cn: 然后他带她去他坐落在一个偏远而秀美的山谷里的房子，向她展示他所有的财产——白色蜂房里的蜜蜂、泽西种奶牛、风信子、银烛台、蓝色的杯子和种植报春花的光亮的花盆。

source: She admired everything, but what pleased her most was the river which ran by the foot of his garden.
zh_cn: 她对一切都很赞赏，但最让她高兴的是那条从他花园脚下流过的河。

source: "Do swans come up here?" she asked.
zh_cn: “天鹅来这里吗？”她问。

source: "Yes, I have often seen swans there on the river," he told her, and she smiled.
zh_cn: “来，我经常在河里见到天鹅，”他对她说，她脸上露出了笑容。

source: Leita made him a good wife.
zh_cn: 蕾塔是个好妻子。

source: She was gentle and friendly, busied herself about the house and garden, polished the bowls, milked the cows and mended his socks.
zh_cn: 她温和友好，在房里花园忙里忙外，擦碗、给奶牛挤奶、给他补袜子。

source: But as time went by Mr. Peters began to feel that she was not happy.
zh_cn: 但是随着时间的流逝，皮特斯先生开始感觉到她不快乐。

source: She seemed restless, wandered much in the garden, and sometimes when he came back from the fields he would find the house empty and she would only return after half an hour or so with no explanation of where she had been.
zh_cn: 她似乎很不安，经常在花园里徘徊，有时他从田里回来时，他会发现房子里空无一人，大约半个小时后她才会回来，也不解释她去了哪里。

source: On these occasions she was always especially tender and would put out his slippers to warm and cook his favourite dish--Welsh rarebit with wild strawberries--for supper.
zh_cn: 在这样的时候她总是特别温柔，她会拿出他的拖鞋暖一暖，烧他最喜欢的菜——野草莓威尔士兔——作晚餐。

source: One evening he was returning home along the river path when he saw Leita in front of him, down by the water.
zh_cn: 一天傍晚他正沿着河边的路回家时看到蕾塔在他前面，在下面的水边上。

source: A swan had sailed up to the verge and she had her arms round its neck and the swan's head rested against her cheek.
zh_cn: 一只天鹅游到了河边，她的胳膊环绕着它的脖子，天鹅的头靠在她的脸颊上。

source: She was weeping, and as he came nearer he saw that tears were rolling, too, from the swan's eyes.
zh_cn: 她在哭泣，当他走得更近时他看到眼泪也在从天鹅的眼睛里滚落。

source: "Leita, what is it?" he asked, very troubled.
zh_cn: “蕾塔，这是什么？”他问道，感到非常不安。

source: "This is my sister," she answered. "I can't bear being separated from her."
zh_cn: “这是我妹妹，”她答道，“我无法忍受和她分开。”

source: Now he understood that Leita was really a swan from the forest, and this made him very sad because when a human being marries a bird it always leads to sorrow.
zh_cn: 现在他明白了蕾塔其实是森林里的一只天鹅，这使他很伤心，因为人类和鸟结婚总是导致悲剧。

source: "I could use my second wish to give your sister human shape, so that she could be a companion to you," he suggested.
zh_cn: “我可以用我的第二个愿望让你妹妹变成人形，这样她就可以和你作伴了，”他建议道。

source: "No, no," she cried, "I couldn't ask that of her."
zh_cn: “不，不，”她叫道，“我不能要求她这样。”

source: "Is it so very hard to be a human being?" asked Mr. Peters sadly.
zh_cn: “做人有这么难吗？”皮特斯先生悲伤地问道。

source: "Very, very hard," she answered.
zh_cn: “非常、非常难，”她答道。

source: "Don't you love me at all, Leita?"
zh_cn: “你一点儿都不爱我吗？蕾塔？”

source: "Yes, I do, I do love you," she said, and there were tears in her eyes again. "But I miss the old life in the forest, the cool grass and the mist rising off the river at sunrise and the feel of the water sliding over my feathers as my sister and I drifted along the stream."
zh_cn: “爱，我真的、真的爱你，”她说，她的眼里又有眼泪了，“但是我想念在森林里的旧日生活，那清凉的草地、日出时从河面上升起的晨雾，还有我和妹妹沿着河流漂游时水滑过我的羽毛的感觉。”

source: "Then shall I use my second wish to turn you back into a swan again?" he asked, and his tongue pricked to remind him of the old King's words, and his heart swelled with grief inside him.
zh_cn: “那么要我用第二个愿望把你再变回天鹅吗？”他问道，他的舌头刺痛让他想起那个老国王的话，他满心悲伤。

source: "Who would darn your socks and cook your meals and see to the hens?"
zh_cn: “谁来给你织补袜子、做饭、照料母鸡呢？”

source: "I'd do it myself as I did before I married you," he said, trying to sound cheerful.
zh_cn: “像我和你结婚以前那样我自己做，”他说，努力让声音听起来很愉快。

source: She shook her head. "No, I could not be as unkind to you as that.
zh_cn: 她摇摇头，“不，我不能对你那么无情。

source: I am partly a swan, but I am also partly a human being now.
zh_cn: 我一部分是天鹅，但现在我也一部分是人类。

source: I will stay with you."
zh_cn: 我要和你在一起。”

source: Poor Mr. Peters was very distressed on his wife's account and did his best to make her life happier, taking her for drives in the car, finding beautiful music for her to listen to on the radio, buying clothes for her and even suggesting a trip round the world.
zh_cn: 可怜的皮特斯先生为他妻子感到很痛苦，竭尽全力让她的生活更快乐，带她开车兜风，为她在收音机里找优美的音乐听，给她买衣服，甚至建议去环球旅行。

source: But she said no to that; she would prefer to stay in their own house near the river.
zh_cn: 但对此她拒绝了；她更喜欢待在他们自己的靠近小河的房子里。

source: He noticed that she spent more and more time baking wonderful cakes--jam puffs, petits fours, eclairs and meringues.
zh_cn: 他注意到她花越来越多的时间烘焙美味的蛋糕——果酱泡芙、花式小蛋糕、长形松饼和蛋白甜饼。

source: One day he saw her take a basketful down to the river and he guessed that she was giving them to her sister.
zh_cn: 一天他看到她拿了满满一篮到河边，他猜想她是给她妹妹的。

source: He built a seat for her by the river, and the two sisters spent hours together there, communicating in some wordless manner.
zh_cn: 他给她在河边建了一个座椅，两姐妹在那里一起度过几个小时的时光，用某种无言的方式交流。

source: For a time he thought that all would be well, but then he saw how thin and pale she was growing.
zh_cn: 他一度认为一切都会好的，但结果他看到她渐渐变得多么苍白瘦弱。

source: One night when he had been late doing the accounts he came up to bed and found her weeping in her sleep and calling:
zh_cn: 一天夜里他算帐到很晚，上床时他发现她在睡梦中哭泣，还叫着：

source: "Rhea!
zh_cn: “瑞亚！

source: Rhea!
zh_cn: 瑞亚！

source: I can't understand what you say!
zh_cn: 我听不懂你说的话！

source: Oh, wait for me, take me with you!"
zh_cn: 哦，等等我，带我一起走！”

source: Then he knew that it was hopeless and she would never be happy as a human.
zh_cn: 这时他知道没有希望了，作为一个人类她永远不会快乐。

source: He stooped down and kissed her goodbye, then took another leaf from his notecase, blew it out of the window, and used up his second wish.
zh_cn: 他弯下腰和她吻别，然后从钱夹里取出另一片叶子，吹出窗外，用掉了他的第二个愿望。

source: Next moment instead of Leita there was a sleeping swan lying across the bed with its head under its wing.
zh_cn: 下一刻不是蕾塔而是一只睡着的天鹅躺在床上，它的头蜷在它的翅膀下。

source: He carried it out of the house and down to the brink of the river, and then he said "Leita! Leita!" to waken her, and gently put her into the water.
zh_cn: 他抱着它出了房子，走到河边，然后他说：“蕾塔！蕾塔！”来唤醒她，把她轻轻地放进水里。

source: She gazed round her in astonishment for a moment, and then came up to him and rested her head lightly against his hand; next instant she was flying away over the trees towards the heart of the forest.
zh_cn: 她惊讶地向四周看了一会儿，然后游到他跟前，将头轻轻地靠在他手上；接下来的瞬间她越过树木向森林中心飞去。

source: He heard a harsh laugh behind him, and turning round saw the old King looking at him with a malicious expression.
zh_cn: 他听到身后传来一声刺耳的大笑，转过身看到那个老国王正面带一种恶毒的表情看着他。

source: "Well, my friend!
zh_cn: “啊，我的朋友！

source: You don't seem to have managed so wonderfully with your first two wishes, do you?
zh_cn: 你的前两个愿望好像用得不怎么好，是不是啊？

source: What will you do with the last?
zh_cn: 最后一个你要怎么用？

source: Turn yourself into a swan?
zh_cn: 把你自己变成一只天鹅？

source: Or turn Leita back into a girl?"
zh_cn: 还是把蕾塔再变成一个女孩？”

source: "I shall do neither," said Mr. Peters calmly. "Human beings and swans are better in their own shapes."
zh_cn: “这两个我都不会做，”皮特斯先生平静地说，“人类和天鹅保持自己的原状最好。”

source: But for all that he looked sadly over towards the forest where Leita had flown, and walked slowly back to his empty house.
zh_cn: 虽然如此他还是悲伤地向蕾塔飞去的森林看去，然后慢慢地走回他空荡荡的房子。

source: Next day he saw two swans swimming at the bottom of the garden, and one of them wore the gold chain he had given Leita after their marriage; she came up and rubbed her head against his hand.
zh_cn: 第二天他看到两只天鹅在花园尽头游水，其中一只戴着他婚后送给蕾塔的金链子；她游上前来，用头摩擦他的手。

source: Mr. Peters and his two swans came to be well known in that part of the country; people used to say that he talked to the swans and they understood him as well as his neighbours.
zh_cn: 皮特斯先生和他的两只天鹅渐渐地在这一地区为大家所熟知；人们常说他和天鹅说话，它们和他的邻居一样熟悉他。

source: Many people were a little frightened of him.
zh_cn: 很多人有点怕他。

source: There was a story that once when thieves tried to break into his house they were set upon by two huge white birds which carried them off bodily and dropped them in the river.
zh_cn: 有一个故事说，曾经有一次小偷试图闯进他的房子时遭到两只巨大的白鸟攻击，它们将他们整个地带走，扔到河里。

source: As Mr. Peters grew old everyone wondered at his contentment.
zh_cn: 随着皮特斯先生渐渐变老，大家都很好奇他是否满意自己的生活。

source: Even when he was bent with rheumatism he would not think of moving to a drier spot, but went slowly about his work, milking the cows and collecting the honey and eggs, with the two swans always somewhere close at hand.
zh_cn: 甚至在他由于风湿病身体弯曲时，他也不想搬到一个更干燥的地方，而是缓慢地做他的工作，给奶牛挤奶，收集蜂蜜和鸡蛋，那两只天鹅总是在附近的某个地方陪着。
